---
type: ServerPath
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ServerPath

`Autodesk.Revit.DB.ServerPath` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ServerPath | 2012 | `public ServerPath ( string centralServerLocation , string path )` |